docs/Chen2008.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-06-05 Mon 19:12 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="preamble" class="status">
<nav><a href="index.html">Home</a> | <a href="blog.html">Blog</a> | <a href="notes.html">Notes</a> | <a href="class.html">Classes</a> | <a href="projects.html">Projects</a> | <a href="todo.html">Todo</a> | <a href="error.html">About</a></nav>
</div>
<div id="content" class="content">
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org670009b">1. A design of a grey-predicted li-ion battery charge system, Chen, L., Hsu, R. C., &amp; Liu, C., IEEE Transactions on Industrial Electronics, (2008)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="article">article</span></span></a></li>
<li><a href="#org9dc8d4f">2. Introduction</a></li>
</ul>
</div>
</nav>
<div id="outline-container-org670009b" class="outline-2">
<h2 id="org670009b"><span class="section-number-2">1.</span> A design of a grey-predicted li-ion battery charge system, Chen, L., Hsu, R. C., &amp; Liu, C., IEEE Transactions on Industrial Electronics, (2008)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="article">article</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
See <a href="&amp;Chen2008">&amp;Chen2008</a>
</p>
</div>
</div>

<div id="outline-container-org9dc8d4f" class="outline-2">
<h2 id="org9dc8d4f"><span class="section-number-2">2.</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>The constant current, constant voltage method was implemented to overcome the problem of requiring a 100% precise full
charge detector</li>
</ul>
<p>
-Under the CC–CV charge strategy, a CC is applied first until the battery voltage increases to a preset voltage (i.e.,
 battery full charged voltage). This CV is held after reaching the preset voltage with the charge current automatically
 reduced. When the charge current reduces to zero, the battery is 100% fully charged.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2023-06-05 Mon 19:12</p>
</div>
</body>
</html>
